* Data Concatenation :- Stacking DataFrames on top of each other (rows) or side by side (columns)

In [2]:
import pandas as pd

In [4]:
df1 = pd.DataFrame({
    "id" : [1, 2, 3],
    "name" : ["bob", "eve", "tom"]
})

df2 = pd.DataFrame({
    "id" : [4, 5, 6],
    "name" : ["rahul", "tomba", "ram"]
})

In [5]:
df1

   id name
0   1  bob
1   2  eve
2   3  tom

In [ ]:
df2

   id   name
0   4  rahul
1   5  tomba
2   6    ram

In [ ]:
# row wise concatenation

pd.concat([df1, df2])

   id   name
0   1    bob
1   2    eve
2   3    tom
0   4  rahul
1   5  tomba
2   6    ram

In [9]:
pd.concat([df1, df2], ignore_index=True)

   id   name
0   1    bob
1   2    eve
2   3    tom
3   4  rahul
4   5  tomba
5   6    ram

In [10]:
# column wise concatenation

pd.concat([df1, df2], axis=1)

   id name  id   name
0   1  bob   4  rahul
1   2  eve   5  tomba
2   3  tom   6    ram